RMCP+ Packet decrypt and authcode.org
#+TITLE: RMCP+ Packet decrypt and authcode
#+AUTHOR: zhang.bin-jie
#+DATE: 2013/08/29
#+EMAIL: zhang.bin-jie@inventec.com.cn
#+DESCRIPTION: A simple guide for RMCP+ Packet decrypt and authcode calculation
#+LANGUAGE: en
#+STYLE: <link rel="stylesheet" type="text/css" href="style.css" />
#+OPTIONS: \n:t
#+OPTIONS: num:nil
#+OPTIONS: ^:nil

* Introduction
RMCP is short for Remote Management Control Protocol. The Distributed Management Task Force (DMTF) specifies the RMCP format.
IPMI v2.0 defines an extended packet format and capabilities that are collectively referred to as "RMCP+".
RMCP+ utilizes authentication algorithms that are more closely aligned with the mechanisms used for the ASF 2.0 specification. In addition, RMCP+ adds data confidentiality (encryption) and a "payloads" capability.

This guide will show how to decrypt the payload and how to calculate the authcode in the RMCP+ packet.

* Packets
We will use the following packets in this guide. All packets are copied from c3_admin_admin.pcap.
All the packets (except #9) are copied from byte offset 0x3a (IPMI Payload).
#+BEGIN_SRC txt
packet #4: RMCP+ Open Session Response
0000   00 00 04 00 a4 a3 a2 a0 fb 2d b5 ff 00 00 00 08
0010   01 00 00 08 01 00 00 08 01 00 00 08 02 00 00 08
0020   01 ff 02 07
#+END_SRC txt

#+BEGIN_SRC txt
packet #5: RAKP Message 1
0000   00 00 00 00 fb 2d b5 ff fe 5a 0a 60 f0 30 cd 69
0010   53 ba ce a2 68 da 47 2c 14 00 00 05 61 64 6d 69
0020   6e
#+END_SRC txt

#+BEGIN_SRC txt
packet #6: RAKP Message 2
0000   00 00 00 00 a4 a3 a2 a0 81 fb 54 df e1 bf 56 47
0010   87 88 ea 7b a1 54 37 5b 00 02 00 03 00 04 00 05
0020   00 06 00 07 00 08 00 09 2d 1a 28 18 2d 6d a8 db
0030   d2 94 c9 00 8a 54 4f 83 f8 5b 4d 51
#+END_SRC txt

#+BEGIN_SRC txt
packet #9: encrypted IPMI 2.0 Packet (from offset 0x2e authtication type)
0000   06 c0 fb 2d b5 ff 03 00 00 00 20 00 41 73 cc 04
0010   c9 07 76 84 a3 b3 ac 57 f3 a8 d7 1d a3 16 8b 36
0020   6f 3d 28 b4 96 d3 39 cc 2f 72 44 36 ff ff 02 07
0030   1c 73 0c 19 38 51 72 14 34 38 d9 11
#+END_SRC txt

* Packet Format
We will decrypt the IPMI payload of packet #9, and calculate the authcode of it. Let's split it first.
#+BEGIN_SRC txt
packet #9: encrypted IPMI 2.0 Packet (from offset 0x2e authtication type)
0000   06 c0 fb 2d b5 ff 03 00 00 00 20 00 41 73 cc 04
0010   c9 07 76 84 a3 b3 ac 57 f3 a8 d7 1d a3 16 8b 36
0020   6f 3d 28 b4 96 d3 39 cc 2f 72 44 36 ff ff 02 07
0030   1c 73 0c 19 38 51 72 14 34 38 d9 11
#+END_SRC txt
According to IPMI SPEC Table 13-8, RMCP/RMCP+ Packet Format for IPMI via Ethernet, packet #9 can be splited to:
1. Auth Type/Format
  06 => Format = RMCP+ (IPMI v2.0 only)
2. Payload Type
  c0 => payload is encrypted, payload is authenticated, payload is IPMI Message (per Table 13-16)
3. IPMI v2.0 RMCP+ Session ID
  fb 2d b5 ff
4. Session Sequence Number
  03 00 00 00
5. IPMI Msg/Payload length
  20 00
6. Confidentiality Header (I will explain later why it's 16 bytes)
  41 73 cc 04 c9 07 76 84 a3 b3 ac 57 f3 a8 d7 1d
7. Payload Data (encrypted. 16 bytes, plus 16 bytes Header, total 0x20 bytes payload)
  a3 16 8b 36 6f 3d 28 b4 96 d3 39 cc 2f 72 44 36
8. Confidentiality Trailer
  none => already padded to payload and encrypted
9. Integrity PAD
  ff ff
10. Pad Length
  02
11. Next Header
  07 => always = 07h for RMCP+ packets
12. AuthCode (Integrity Data)
  1c 73 0c 19 38 51 72 14 34 38 d9 11

* Targets
We have two targets:
1. Decrypt the IPMI payload (part 7 in packet)
  a3 16 8b 36 6f 3d 28 b4 96 d3 39 cc 2f 72 44 36
2. AuthCode (Integrity Data) (part 12 in packet)
  1c 73 0c 19 38 51 72 14 34 38 d9 11

* Algorithms
To decrypt the payload and calculate the authcode, we have to first find the Integrity and Confidentiality algorithms. They both can be found in the RMCP+ Open Session Response packet:
#+BEGIN_SRC txt
packet #4: RMCP+ Open Session Response
0000   00 00 04 00 a4 a3 a2 a0 fb 2d b5 ff 00 00 00 08
0010   01 00 00 08 01 00 00 08 01 00 00 08 02 00 00 08
0020   01 ff 02 07
#+END_SRC txt
According to IPMI SPEC Table 13-10, RMCP+ Open Session Response:
1. bytes 13:20 Authentication Payload => byte 17 Authentication Algorithm
  01
  => Table 13-17, Authentication Algorithm Numbers => RAKP-HMAC-SHA1
2. bytes 21:28 Integrity Payload => byte 25 Integrity Algorithm
  01
  => Table 13-18, Integrity Algorithm Numbers => HMAC-SHA1-96
3. bytes 29:36 Confidentiality Payload => byte 33 Confidentiality Algorithm
  01
  => Table 13-19, Confidentiality Algorithm Numbers => AES-CBC-128

So Integrity algorithm is HMAC-SHA1-96 and Confidentiality algorithm is AES-CBC-128.
The integrity algorithm HMAC-SHA1-96 will be used to calculate authcode, and the confidentiality algorithm AES-CBC-128 will be used to decrypt the IPMI payload.

* Target 1. Decrypt the IPMI payload
To decrypt the payload with AES-CBC-128, we need
1. 16 bytes Initialization Vector, which is Confidentiality Header in the packet:
  41 73 cc 04 c9 07 76 84 a3 b3 ac 57 f3 a8 d7 1d
2. 16 bytes (128-bits) Cipher Key.

This info can be found in IPMI SPEC:
Table 13-20, AES-CBC Encrypted Payload Fields:
#+BEGIN_QUOTE
Confidentiality Header | Initialization Vector | 16 bytes.
#+END_QUOTE
This is why the confidentiality header in packet #9 is 16 bytes.

13.29.2 Encryption with AES:
#+BEGIN_QUOTE
AES-128 uses a 128-bit Cipher Key. The Cipher Key is the first 128-bits of key "K2", K2 is generated from the Session Integrity Key (SIK) that was created during session activation. See Section 13.22, RAKP Message 3 and Section 13.32, Generating Additional Keying Material.
#+END_QUOTE

The 16 byte cipher key is got from K2, and K2 is generated from SIK, so we need first get the SIK and K2.
 
