RMCP+ Packet decrypt and authcode.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>RMCP+ Packet decrypt and authcode</title>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8"/>
<meta name="title" content="RMCP+ Packet decrypt and authcode"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2013/08/29"/>
<meta name="author" content="zhang.bin-jie"/>
<meta name="description" content="A simple guide for RMCP+ Packet decrypt and authcode calculation"/>
<meta name="keywords" content=""/>

<link rel="stylesheet" type="text/css" href="style.css" />


</head>
<body>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">RMCP+ Packet decrypt and authcode</h1>


<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">Introduction</a></li>
<li><a href="#sec-2">Packets</a></li>
<li><a href="#sec-3">Packet Format</a></li>
<li><a href="#sec-4">Targets</a></li>
<li><a href="#sec-5">Algorithms</a></li>
<li><a href="#sec-6">Target 1. Decrypt the IPMI payload</a>
<ul>
<li><a href="#sec-6-1">Session Integrity Key (SIK)</a></li>
<li><a href="#sec-6-2">K2</a>
<ul>
<li><a href="#sec-6-2-1">Calculate the SIK</a></li>
<li><a href="#sec-6-2-2">Calculate the K2</a></li>
</ul>
</li>
<li><a href="#sec-6-3">Decrypt the payload</a></li>
</ul>
</li>
<li><a href="#sec-7">Target 2. AuthCode (Integrity Data)</a>
<ul>
<li><a href="#sec-7-1">K1</a>
<ul>
<li><a href="#sec-7-1-1">Calculate the K1</a></li>
</ul>
</li>
<li><a href="#sec-7-2">Calculate the AuthCode</a></li>
</ul>
</li>
<li><a href="#sec-8">More examples</a></li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1">Introduction</h2>
<div class="outline-text-2" id="text-1">

<p>RMCP is short for Remote Management Control Protocol. The Distributed Management Task Force (DMTF) specifies the RMCP format.<br/>
IPMI v2.0 defines an extended packet format and capabilities that are collectively referred to as "RMCP+".<br/>
RMCP+ utilizes authentication algorithms that are more closely aligned with the mechanisms used for the ASF 2.0 specification. In addition, RMCP+ adds data confidentiality (encryption) and a "payloads" capability.<br/>
</p>
<p><br/>
This guide will show how to decrypt the payload and how to calculate the authcode in the RMCP+ packet.<br/>
</p>
<p><br/>
</p></div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2">Packets</h2>
<div class="outline-text-2" id="text-2">

<p>We will use the following packets in this guide. All packets are copied from c3_admin_admin.pcap.<br/>
All the packets (except #9) are copied from byte offset 0x3a (IPMI Payload).<br/>
</p>
<p><br/>
<pre class="example">packet #4: RMCP+ Open Session Response
0000   00 00 04 00 a4 a3 a2 a0 fb 2d b5 ff 00 00 00 08
0010   01 00 00 08 01 00 00 08 01 00 00 08 02 00 00 08
0020   01 ff 02 07
</pre>



<pre class="example">packet #5: RAKP Message 1
0000   00 00 00 00 fb 2d b5 ff fe 5a 0a 60 f0 30 cd 69
0010   53 ba ce a2 68 da 47 2c 14 00 00 05 61 64 6d 69
0020   6e
</pre>



<pre class="example">packet #6: RAKP Message 2
0000   00 00 00 00 a4 a3 a2 a0 81 fb 54 df e1 bf 56 47
0010   87 88 ea 7b a1 54 37 5b 00 02 00 03 00 04 00 05
0020   00 06 00 07 00 08 00 09 2d 1a 28 18 2d 6d a8 db
0030   d2 94 c9 00 8a 54 4f 83 f8 5b 4d 51
</pre>



<pre class="example">packet #9: encrypted IPMI 2.0 Packet (from offset 0x2e authtication type)
0000   06 c0 fb 2d b5 ff 03 00 00 00 20 00 41 73 cc 04
0010   c9 07 76 84 a3 b3 ac 57 f3 a8 d7 1d a3 16 8b 36
0020   6f 3d 28 b4 96 d3 39 cc 2f 72 44 36 ff ff 02 07
0030   1c 73 0c 19 38 51 72 14 34 38 d9 11
</pre>


</p></div>

</div>

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3">Packet Format</h2>
<div class="outline-text-2" id="text-3">

<p>We will decrypt the IPMI payload of packet #9, and calculate the authcode of it. Let's split it first.<br/>
</p>
<p><br/>
<pre class="example">packet #9: encrypted IPMI 2.0 Packet (from offset 0x2e authtication type)
0000   06 c0 fb 2d b5 ff 03 00 00 00 20 00 41 73 cc 04
0010   c9 07 76 84 a3 b3 ac 57 f3 a8 d7 1d a3 16 8b 36
0020   6f 3d 28 b4 96 d3 39 cc 2f 72 44 36 ff ff 02 07
0030   1c 73 0c 19 38 51 72 14 34 38 d9 11
</pre>

According to IPMI SPEC Table 13-8, RMCP/RMCP+ Packet Format for IPMI via Ethernet, packet #9 can be splited to:<br/>
</p><ol>
<li>Auth Type/Format<br/>
  06 =&gt; Format = RMCP+ (IPMI v2.0 only)<br/>
</li>
<li>Payload Type<br/>
  c0 =&gt; payload is encrypted, payload is authenticated, payload is IPMI Message (per Table 13-16)<br/>
</li>
<li>IPMI v2.0 RMCP+ Session ID<br/>
  fb 2d b5 ff<br/>
</li>
<li>Session Sequence Number<br/>
  03 00 00 00<br/>
</li>
<li>IPMI Msg/Payload length<br/>
  20 00<br/>
</li>
<li>Confidentiality Header (I will explain later why it's 16 bytes)<br/>
  41 73 cc 04 c9 07 76 84 a3 b3 ac 57 f3 a8 d7 1d<br/>
</li>
<li>Payload Data (encrypted. 16 bytes, plus 16 bytes Header, total 0x20 bytes payload)<br/>
  a3 16 8b 36 6f 3d 28 b4 96 d3 39 cc 2f 72 44 36<br/>
</li>
<li>Confidentiality Trailer<br/>
  none =&gt; already padded to payload and encrypted<br/>
</li>
<li>Integrity PAD<br/>
  ff ff<br/>
</li>
<li>Pad Length<br/>
  02<br/>
</li>
<li>Next Header<br/>
  07 =&gt; always = 07h for RMCP+ packets<br/>
</li>
<li>AuthCode (Integrity Data)<br/>
  1c 73 0c 19 38 51 72 14 34 38 d9 11<br/>
</li>
</ol>


<p><br/>
</p></div>

</div>

<div id="outline-container-4" class="outline-2">
<h2 id="sec-4">Targets</h2>
<div class="outline-text-2" id="text-4">

<p>We have two targets:<br/>
</p><ol>
<li>Decrypt the IPMI payload (part 7 in packet)<br/>
  a3 16 8b 36 6f 3d 28 b4 96 d3 39 cc 2f 72 44 36<br/>
</li>
<li>AuthCode (Integrity Data) (part 12 in packet)<br/>
  1c 73 0c 19 38 51 72 14 34 38 d9 11<br/>
</li>
</ol>


<p><br/>
</p></div>

</div>

<div id="outline-container-5" class="outline-2">
<h2 id="sec-5">Algorithms</h2>
<div class="outline-text-2" id="text-5">

<p>To decrypt the payload and calculate the authcode, we have to first find the Integrity and Confidentiality algorithms. They both can be found in the RMCP+ Open Session Response packet:<br/>
</p>
<p><br/>
<pre class="example">packet #4: RMCP+ Open Session Response
0000   00 00 04 00 a4 a3 a2 a0 fb 2d b5 ff 00 00 00 08
0010   01 00 00 08 01 00 00 08 01 00 00 08 02 00 00 08
0020   01 ff 02 07
</pre>

According to IPMI SPEC Table 13-10, RMCP+ Open Session Response:<br/>
</p><ol>
<li>bytes 13:20 Authentication Payload =&gt; byte 17 Authentication Algorithm<br/>
  01<br/>
  =&gt; Table 13-17, Authentication Algorithm Numbers =&gt; RAKP-HMAC-SHA1<br/>
</li>
<li>bytes 21:28 Integrity Payload =&gt; byte 25 Integrity Algorithm<br/>
  01<br/>
  =&gt; Table 13-18, Integrity Algorithm Numbers =&gt; HMAC-SHA1-96<br/>
</li>
<li>bytes 29:36 Confidentiality Payload =&gt; byte 33 Confidentiality Algorithm<br/>
  01<br/>
  =&gt; Table 13-19, Confidentiality Algorithm Numbers =&gt; AES-CBC-128<br/>
</li>
</ol>


<p><br/>
So Integrity algorithm is HMAC-SHA1-96 and Confidentiality algorithm is AES-CBC-128.<br/>
The integrity algorithm HMAC-SHA1-96 will be used to calculate authcode, and the confidentiality algorithm AES-CBC-128 will be used to decrypt the IPMI payload.<br/>
</p>
<p><br/>
</p></div>

</div>

<div id="outline-container-6" class="outline-2">
<h2 id="sec-6">Target 1. Decrypt the IPMI payload</h2>
<div class="outline-text-2" id="text-6">

<p>To decrypt the payload with AES-CBC-128, we need<br/>
</p><ol>
<li>16 bytes Initialization Vector, which is Confidentiality Header in the packet:<br/>
  41 73 cc 04 c9 07 76 84 a3 b3 ac 57 f3 a8 d7 1d<br/>
</li>
<li>16 bytes (128-bits) Cipher Key.<br/>
</li>
</ol>


<p><br/>
This info can be found in IPMI SPEC:<br/>
Table 13-20, AES-CBC Encrypted Payload Fields:<br/>
</p><blockquote>

<p>Confidentiality Header | Initialization Vector | 16 bytes.<br/>
</p>
</blockquote>


<p><br/>
This is why the confidentiality header in packet #9 is 16 bytes.<br/>
</p>
<p><br/>
13.29.2 Encryption with AES:<br/>
</p><blockquote>

<p>AES-128 uses a 128-bit Cipher Key. The Cipher Key is the first 128-bits of key "K2", K2 is generated from the Session Integrity Key (SIK) that was created during session activation. See Section 13.22, RAKP Message 3 and Section 13.32, Generating Additional Keying Material.<br/>
</p>
</blockquote>


<p><br/>
The 16 byte cipher key is got from K2, and K2 is generated from SIK, so we need first get the SIK and K2.<br/>
</p>
<p> <br/>
</p>
</div>
