RMCP+ Packet decrypt and authcode.org
** Session Integrity Key (SIK)
According to IPMI SPEC 13.31 RMCP+ Authenticated Key-Exchange Protocol (RAKP):
#+BEGIN_QUOTE
SIK = HMAC KG (Rm | Rc | RoleM | ULengthM | <UNameM>)
#+END_QUOTE

SIK is the result of HMAC with data "Rm + Rc + RoleM + ULengthM + <UNameM>" and key "KG".

About KG, SPEC says: "Note that K[UID] is used in place of Kg if 'one-key' logins are being used." Then What's K[UID]?
According to IPMI SPEC 13.31 RMCP+ Authenticated Key-Exchange Protocol (RAKP):
#+BEGIN_QUOTE
A user needs to know both KG and a user password (key K[UID]) to establish a session, unless the channel is configured with a 'null' KG, in which case the user key (K[UID]) is used in place of KG in the algorithms. 
#+END_QUOTE
Our BMC uses a 'null' KG by default and none changed the KG, so K[UID] is the user password. And so the user password is used to calculate the SIK.

Rm, Rc, RoleM, ULengthM and UNameM can be found in RAKP Message 1 and 2.
#+BEGIN_SRC txt
packet #5: RAKP Message 1
0000   00 00 00 00 fb 2d b5 ff fe 5a 0a 60 f0 30 cd 69
0010   53 ba ce a2 68 da 47 2c 14 00 00 05 61 64 6d 69
0020   6e
#+END_SRC txt

#+BEGIN_SRC txt
packet #6: RAKP Message 2
0000   00 00 00 00 a4 a3 a2 a0 81 fb 54 df e1 bf 56 47
0010   87 88 ea 7b a1 54 37 5b 00 02 00 03 00 04 00 05
0020   00 06 00 07 00 08 00 09 2d 1a 28 18 2d 6d a8 db
0030   d2 94 c9 00 8a 54 4f 83 f8 5b 4d 51
#+END_SRC txt
According to IPMI SPEC: the table in page 162 below the Message 2, Table 13-11, RAKP Message 1 and Table 13-12, RAKP Message 2:
+ Rm:   Remote Console Random Number
  RAKP Message 1 bytes 9:24
  fe 5a 0a 60 f0 30 cd 69 53 ba ce a2 68 da 47 2c
+ Rc:   Managed System Random Number
  RAKP Message 2 bytes 9:24
  81 fb 54 df e1 bf 56 47 87 88 ea 7b a1 54 37 5b
+ Rolem: Requested Privilege Level
  RAKP Message 1 byte 25
  14
+ ULengthm: User Name Length byte
  RAKP Message 1 byte 28
  05
+ UNamem: User Name bytes
  RAKP Message 1 bytes 29:44
  61 64 6d 69 6e

+ KG
  K[UID] (user password) is "admin" in this session.
  admin
  => ASCII: 61 64 6D 69 6E
  => pad to 16 bytes: 61 64 6D 69 6E 00 00 00 00 00 00 00 00 00 00 00

** K2
According to IPMI SPEC 13.32 Generating Additional Keying Material:
#+BEGIN_QUOTE
K2 = HMAC SIK (const 2)
#+END_QUOTE
K2 is the result of HMAC with data "const 2" and key "SIK".
Where const 2 is
#+BEGIN_QUOTE
Const 2 = 0x02020202020202020202 02020202020202020202
#+END_QUOTE

Let's calculate the SIK and K2.

*** Calculate the SIK
--------------------------------------------------------------------------------
#+BEGIN_SRC txt
data:
fe 5a 0a 60 f0 30 cd 69 53 ba ce a2 68 da 47 2c
81 fb 54 df e1 bf 56 47 87 88 ea 7b a1 54 37 5b
14
05
61 64 6d 69 6e
key:
61 64 6D 69 6E 00 00 00 00 00 00 00 00 00 00 00
=> HMAC-SHA1:
95 60 c5 61 dc 13 ed 48 7f f6 f4 c8 f0 8b 9f 3e 03 d7 49 40
#+END_SRC txt
--------------------------------------------------------------------------------

*** Calculate the K2
--------------------------------------------------------------------------------
#+BEGIN_SRC txt
data(const 2: 20 bytes 0x02):
02 02 02 02 02 02 02 02 02 02 02 02 02 02 02 02 02 02 02 02
key(SIK):
95 60 c5 61 dc 13 ed 48 7f f6 f4 c8 f0 8b 9f 3e 03 d7 49 40
=> HMAC-SHA1:
d6 4d 9a a8 6d 62 02 23 2e f8 cb f0 06 31 9b 6b 16 e3 14 26
=> first 16 bytes(128-bits):
d6 4d 9a a8 6d 62 02 23 2e f8 cb f0 06 31 9b 6b
#+END_SRC txt
--------------------------------------------------------------------------------

So we get all the necessary info. Let's decrypt the payload.

** Decrypt the payload
--------------------------------------------------------------------------------
#+BEGIN_SRC txt
packet #9: encrypted IPMI 2.0 Packet (from offset 0x2e authtication type)
0000   06 c0 fb 2d b5 ff 03 00 00 00 20 00 41 73 cc 04
0010   c9 07 76 84 a3 b3 ac 57 f3 a8 d7 1d a3 16 8b 36
0020   6f 3d 28 b4 96 d3 39 cc 2f 72 44 36 ff ff 02 07
0030   1c 73 0c 19 38 51 72 14 34 38 d9 11
#+END_SRC txt

#+BEGIN_SRC txt
IV:
41 73 cc 04 c9 07 76 84 a3 b3 ac 57 f3 a8 d7 1d
key(K2):
d6 4d 9a a8 6d 62 02 23 2e f8 cb f0 06 31 9b 6b
encrypted payload:
a3 16 8b 36 6f 3d 28 b4 96 d3 39 cc 2f 72 44 36
=> AES-CBC decrypt:
20 18 c8 81 04 3b 04 3c 01 02 03 04 05 06 07 07
#+END_SRC txt
According to IPMI SPEC Table 13-20, AES-CBC Encrypted Payload Fields, last byte is Confidentiality Pad Length:
07
#+BEGIN_SRC txt
=> Confidentiality Pad:
01 02 03 04 05 06 07
=> IPMI Payload:
20 18 c8 81 04 3b 04 3c
#+END_SRC txt

Our first target is done!

* Target 2. AuthCode (Integrity Data)
First we need find the data to be calculated and authcode we expected.
According to IPMI SPEC 13.28.4 Integrity Algorithms:
#+BEGIN_QUOTE
Unless otherwise specified, the integrity algorithm is applied to the packet data starting with AuthType/Format field up to and including the field that immediately precedes the AuthCode field itself.
#+END_QUOTE
So the data and expected authcode are:
#+BEGIN_SRC txt
packet #9: encrypted IPMI 2.0 Packet (from offset 0x2e authtication type)
0000   06 c0 fb 2d b5 ff 03 00 00 00 20 00 41 73 cc 04
0010   c9 07 76 84 a3 b3 ac 57 f3 a8 d7 1d a3 16 8b 36
0020   6f 3d 28 b4 96 d3 39 cc 2f 72 44 36 ff ff 02 07
0030   1c 73 0c 19 38 51 72 14 34 38 d9 11
#+END_SRC txt
=>
#+BEGIN_SRC txt
data:
0000   06 c0 fb 2d b5 ff 03 00 00 00 20 00 41 73 cc 04
0010   c9 07 76 84 a3 b3 ac 57 f3 a8 d7 1d a3 16 8b 36
0020   6f 3d 28 b4 96 d3 39 cc 2f 72 44 36 ff ff 02 07
#+END_SRC txt

#+BEGIN_SRC txt
AuthCode (our target)
0030   1c 73 0c 19 38 51 72 14 34 38 d9 11
#+END_SRC txt

authcode = HASH key (data)
Where HASH is the integrity algorithm. i.e. HMAC-SHA1-96. We need find the key.

According to IPMI SPEC 13.28.4 Integrity Algorithms:
#+BEGIN_QUOTE
HMAC-SHA1-96, HMAC-SHA256-128, and HMAC-MD5-128 utilize take the Session Integrity Key and use it to generate K1. K1 is then used as the key for use in HMAC to produce the AuthCode field. For "one one-key" logins, the user's key (password) is used.
#+END_QUOTE

Let's calculate the K1.

** K1
According to IPMI SPEC 13.32 Generating Additional Keying Material
#+BEGIN_QUOTE
K1 = HMAC SIK (const 1)
Const 1 = 0x01010101010101010101 01010101010101010101
#+END_QUOTE

*** Calculate the K1
--------------------------------------------------------------------------------
#+BEGIN_SRC txt
data(const 1: 20 bytes 0x01):
01 01 01 01 01 01 01 01 01 01 01 01 01 01 01 01 01 01 01 01
key(SIK):
95 60 c5 61 dc 13 ed 48 7f f6 f4 c8 f0 8b 9f 3e 03 d7 49 40
=> HMAC-SHA1:
e8 9c b1 4c 9f 39 c6 6e 75 e8 e5 54 d4 11 60 b9 1c ba a1 e7
#+END_SRC txt
--------------------------------------------------------------------------------

Now we can calculate authcode.

