RMCP+ Packet decrypt and authcode.html

<div id="outline-container-6-1" class="outline-3">
<h3 id="sec-6-1">Session Integrity Key (SIK)</h3>
<div class="outline-text-3" id="text-6-1">

<p>According to IPMI SPEC 13.31 RMCP+ Authenticated Key-Exchange Protocol (RAKP):<br/>
</p><blockquote>

<p>SIK = HMAC KG (Rm | Rc | RoleM | ULengthM | &lt;UNameM&gt;)<br/>
</p>
</blockquote>


<p><br/>
SIK is the result of HMAC with data "Rm + Rc + RoleM + ULengthM + &lt;UNameM&gt;" and key "KG".<br/>
</p>
<p><br/>
About KG, SPEC says: "Note that K[UID] is used in place of Kg if 'one-key' logins are being used." Then What's K[UID]?<br/>
According to IPMI SPEC 13.31 RMCP+ Authenticated Key-Exchange Protocol (RAKP):<br/>
</p><blockquote>

<p>A user needs to know both KG and a user password (key K[UID]) to establish a session, unless the channel is configured with a 'null' KG, in which case the user key (K[UID]) is used in place of KG in the algorithms. <br/>
</p>
</blockquote>


<p><br/>
Our BMC uses a 'null' KG by default and none changed the KG, so K[UID] is the user password. And so the user password is used to calculate the SIK.<br/>
</p>
<p><br/>
Rm, Rc, RoleM, ULengthM and UNameM can be found in RAKP Message 1 and 2.<br/>
</p>
<p><br/>
<pre class="example">packet #5: RAKP Message 1
0000   00 00 00 00 fb 2d b5 ff fe 5a 0a 60 f0 30 cd 69
0010   53 ba ce a2 68 da 47 2c 14 00 00 05 61 64 6d 69
0020   6e
</pre>



<pre class="example">packet #6: RAKP Message 2
0000   00 00 00 00 a4 a3 a2 a0 81 fb 54 df e1 bf 56 47
0010   87 88 ea 7b a1 54 37 5b 00 02 00 03 00 04 00 05
0020   00 06 00 07 00 08 00 09 2d 1a 28 18 2d 6d a8 db
0030   d2 94 c9 00 8a 54 4f 83 f8 5b 4d 51
</pre>

According to IPMI SPEC: the table in page 162 below the Message 2, Table 13-11, RAKP Message 1 and Table 13-12, RAKP Message 2:<br/>
</p><ul>
<li>Rm:   Remote Console Random Number<br/>
  RAKP Message 1 bytes 9:24<br/>
  fe 5a 0a 60 f0 30 cd 69 53 ba ce a2 68 da 47 2c<br/>
</li>
<li>Rc:   Managed System Random Number<br/>
  RAKP Message 2 bytes 9:24<br/>
  81 fb 54 df e1 bf 56 47 87 88 ea 7b a1 54 37 5b<br/>
</li>
<li>Rolem: Requested Privilege Level<br/>
  RAKP Message 1 byte 25<br/>
  14<br/>
</li>
<li>ULengthm: User Name Length byte<br/>
  RAKP Message 1 byte 28<br/>
  05<br/>
</li>
<li>UNamem: User Name bytes<br/>
  RAKP Message 1 bytes 29:44<br/>
  61 64 6d 69 6e<br/>

<p><br/>
</p></li>
<li>KG<br/>
  K[UID] (user password) is "admin" in this session.<br/>
  admin<br/>
  =&gt; ASCII: 61 64 6D 69 6E<br/>
  =&gt; pad to 16 bytes: 61 64 6D 69 6E 00 00 00 00 00 00 00 00 00 00 00<br/>
</li>
</ul>


<p><br/>
</p></div>

</div>

<div id="outline-container-6-2" class="outline-3">
<h3 id="sec-6-2">K2</h3>
<div class="outline-text-3" id="text-6-2">

<p>According to IPMI SPEC 13.32 Generating Additional Keying Material:<br/>
</p><blockquote>

<p>K2 = HMAC SIK (const 2)<br/>
</p>
</blockquote>


<p><br/>
K2 is the result of HMAC with data "const 2" and key "SIK".<br/>
Where const 2 is<br/>
</p><blockquote>

<p>Const 2 = 0x02020202020202020202 02020202020202020202<br/>
</p>
</blockquote>


<p><br/>
Let's calculate the SIK and K2.<br/>
</p>
<p><br/>
</p>
</div>

<div id="outline-container-6-2-1" class="outline-4">
<h4 id="sec-6-2-1">Calculate the SIK</h4>
<div class="outline-text-4" id="text-6-2-1">


<hr/>

<p><br/>
<pre class="example">data:
fe 5a 0a 60 f0 30 cd 69 53 ba ce a2 68 da 47 2c
81 fb 54 df e1 bf 56 47 87 88 ea 7b a1 54 37 5b
14
05
61 64 6d 69 6e
key:
61 64 6D 69 6E 00 00 00 00 00 00 00 00 00 00 00
=&gt; HMAC-SHA1:
95 60 c5 61 dc 13 ed 48 7f f6 f4 c8 f0 8b 9f 3e 03 d7 49 40
</pre>


</p>
<hr/>

<p><br/>
</p></div>

</div>

<div id="outline-container-6-2-2" class="outline-4">
<h4 id="sec-6-2-2">Calculate the K2</h4>
<div class="outline-text-4" id="text-6-2-2">


<hr/>

<p><br/>
<pre class="example">data(const 2: 20 bytes 0x02):
02 02 02 02 02 02 02 02 02 02 02 02 02 02 02 02 02 02 02 02
key(SIK):
95 60 c5 61 dc 13 ed 48 7f f6 f4 c8 f0 8b 9f 3e 03 d7 49 40
=&gt; HMAC-SHA1:
d6 4d 9a a8 6d 62 02 23 2e f8 cb f0 06 31 9b 6b 16 e3 14 26
=&gt; first 16 bytes(128-bits):
d6 4d 9a a8 6d 62 02 23 2e f8 cb f0 06 31 9b 6b
</pre>


</p>
<hr/>

<p><br/>
So we get all the necessary info. Let's decrypt the payload.<br/>
</p>
<p><br/>
</p></div>
</div>

</div>

<div id="outline-container-6-3" class="outline-3">
<h3 id="sec-6-3">Decrypt the payload</h3>
<div class="outline-text-3" id="text-6-3">


<hr/>

<p><br/>
<pre class="example">packet #9: encrypted IPMI 2.0 Packet (from offset 0x2e authtication type)
0000   06 c0 fb 2d b5 ff 03 00 00 00 20 00 41 73 cc 04
0010   c9 07 76 84 a3 b3 ac 57 f3 a8 d7 1d a3 16 8b 36
0020   6f 3d 28 b4 96 d3 39 cc 2f 72 44 36 ff ff 02 07
0030   1c 73 0c 19 38 51 72 14 34 38 d9 11
</pre>



<pre class="example">IV:
41 73 cc 04 c9 07 76 84 a3 b3 ac 57 f3 a8 d7 1d
key(K2):
d6 4d 9a a8 6d 62 02 23 2e f8 cb f0 06 31 9b 6b
encrypted payload:
a3 16 8b 36 6f 3d 28 b4 96 d3 39 cc 2f 72 44 36
=&gt; AES-CBC decrypt:
20 18 c8 81 04 3b 04 3c 01 02 03 04 05 06 07 07
</pre>

According to IPMI SPEC Table 13-20, AES-CBC Encrypted Payload Fields, last byte is Confidentiality Pad Length:<br/>
07<br/>
</p>
<p><br/>
<pre class="example">=&gt; Confidentiality Pad:
01 02 03 04 05 06 07
=&gt; IPMI Payload:
20 18 c8 81 04 3b 04 3c
</pre>


Our first target is done!<br/>
</p>
<p><br/>
</p></div>
</div>

</div>

<div id="outline-container-7" class="outline-2">
<h2 id="sec-7">Target 2. AuthCode (Integrity Data)</h2>
<div class="outline-text-2" id="text-7">

<p>First we need find the data to be calculated and authcode we expected.<br/>
According to IPMI SPEC 13.28.4 Integrity Algorithms:<br/>
</p><blockquote>

<p>Unless otherwise specified, the integrity algorithm is applied to the packet data starting with AuthType/Format field up to and including the field that immediately precedes the AuthCode field itself.<br/>
</p>
</blockquote>


<p><br/>
So the data and expected authcode are:<br/>
</p>
<p><br/>
<pre class="example">packet #9: encrypted IPMI 2.0 Packet (from offset 0x2e authtication type)
0000   06 c0 fb 2d b5 ff 03 00 00 00 20 00 41 73 cc 04
0010   c9 07 76 84 a3 b3 ac 57 f3 a8 d7 1d a3 16 8b 36
0020   6f 3d 28 b4 96 d3 39 cc 2f 72 44 36 ff ff 02 07
0030   1c 73 0c 19 38 51 72 14 34 38 d9 11
</pre>

=&gt;<br/>
</p>
<p><br/>
<pre class="example">data:
0000   06 c0 fb 2d b5 ff 03 00 00 00 20 00 41 73 cc 04
0010   c9 07 76 84 a3 b3 ac 57 f3 a8 d7 1d a3 16 8b 36
0020   6f 3d 28 b4 96 d3 39 cc 2f 72 44 36 ff ff 02 07
</pre>



<pre class="example">AuthCode (our target)
0030   1c 73 0c 19 38 51 72 14 34 38 d9 11
</pre>


authcode = HASH key (data)<br/>
Where HASH is the integrity algorithm. i.e. HMAC-SHA1-96. We need find the key.<br/>
</p>
<p><br/>
According to IPMI SPEC 13.28.4 Integrity Algorithms:<br/>
</p><blockquote>

<p>HMAC-SHA1-96, HMAC-SHA256-128, and HMAC-MD5-128 utilize take the Session Integrity Key and use it to generate K1. K1 is then used as the key for use in HMAC to produce the AuthCode field. For "one one-key" logins, the user's key (password) is used.<br/>
</p>
</blockquote>


<p><br/>
Let's calculate the K1.<br/>
</p>
<p><br/>
</p>
</div>

<div id="outline-container-7-1" class="outline-3">
<h3 id="sec-7-1">K1</h3>
<div class="outline-text-3" id="text-7-1">

<p>According to IPMI SPEC 13.32 Generating Additional Keying Material<br/>
</p><blockquote>

<p>K1 = HMAC SIK (const 1)<br/>
Const 1 = 0x01010101010101010101 01010101010101010101<br/>
</p>
</blockquote>


<p><br/>
</p>
</div>

<div id="outline-container-7-1-1" class="outline-4">
<h4 id="sec-7-1-1">Calculate the K1</h4>
<div class="outline-text-4" id="text-7-1-1">


<hr/>

<p><br/>
<pre class="example">data(const 1: 20 bytes 0x01):
01 01 01 01 01 01 01 01 01 01 01 01 01 01 01 01 01 01 01 01
key(SIK):
95 60 c5 61 dc 13 ed 48 7f f6 f4 c8 f0 8b 9f 3e 03 d7 49 40
=&gt; HMAC-SHA1:
e8 9c b1 4c 9f 39 c6 6e 75 e8 e5 54 d4 11 60 b9 1c ba a1 e7
</pre>


</p>
<hr/>

<p><br/>
Now we can calculate authcode.<br/>
</p>
<p><br/>
</p></div>
</div>

</div>
