RMCP+ Packet decrypt and authcode.html

<div id="outline-container-7-2" class="outline-3">
<h3 id="sec-7-2">Calculate the AuthCode</h3>
<div class="outline-text-3" id="text-7-2">


<hr/>

<p><br/>
<pre class="example">data:
06 c0 fb 2d b5 ff 03 00 00 00 20 00 41 73 cc 04
c9 07 76 84 a3 b3 ac 57 f3 a8 d7 1d a3 16 8b 36
6f 3d 28 b4 96 d3 39 cc 2f 72 44 36 ff ff 02 07
key(K1):
e8 9c b1 4c 9f 39 c6 6e 75 e8 e5 54 d4 11 60 b9 1c ba a1 e7
=&gt; HMAC-SHA1:
1c 73 0c 19 38 51 72 14 34 38 d9 11 e2 a5 30 c9 7b c8 0e 4d
</pre>

According to IPMI SPEC 13.28.4 Integrity Algorithms:<br/>
</p><blockquote>

<p>When the HMAC-SHA1-96 Integrity Algorithm is used the resulting AuthCode field is 12 bytes (96 bits).<br/>
</p>
</blockquote>


<p><br/>
So we only need the first 12 byte:<br/>
1c 73 0c 19 38 51 72 14 34 38 d9 11<br/>
</p>
<p><br/>
Our second target is done!<br/>
</p>
<p><br/>
</p></div>
</div>

</div>

<div id="outline-container-8" class="outline-2">
<h2 id="sec-8">More examples</h2>
<div class="outline-text-2" id="text-8">


<hr/>

<p><br/>
<pre class="example">packet #10
0000   06 c0 a4 a3 a2 a0 01 00 00 00 20 00 81 fb 54 df
0010   e1 bf 56 47 87 88 ea 7b a1 54 37 5b f3 ec 4c ee
0020   d6 f8 09 07 5f 18 d3 33 21 b5 a5 b1 ff ff 02 07
0030   99 f7 68 57 f3 39 cf 11 33 54 6d b4
</pre>


</p>
<hr/>

<p><br/>
<pre class="example">Decrypt
IV:
81 fb 54 df e1 bf 56 47 87 88 ea 7b a1 54 37 5b
data:
f3 ec 4c ee d6 f8 09 07 5f 18 d3 33 21 b5 a5 b1
key(K2):
d6 4d 9a a8 6d 62 02 23 2e f8 cb f0 06 31 9b 6b
=&gt; decrypt:
81 1c 63 20 04 3b 00 04 9d 01 02 03 04 05 06 06
=&gt; remove pad:
81 1c 63 20 04 3b 00 04 9d
</pre>


</p>
<hr/>

<p><br/>
<pre class="example">AuthCode
99 f7 68 57 f3 39 cf 11 33 54 6d b4
data:
06 c0 a4 a3 a2 a0 01 00 00 00 20 00 81 fb 54 df
e1 bf 56 47 87 88 ea 7b a1 54 37 5b f3 ec 4c ee
d6 f8 09 07 5f 18 d3 33 21 b5 a5 b1 ff ff 02 07
key(K1):
e8 9c b1 4c 9f 39 c6 6e 75 e8 e5 54 d4 11 60 b9 1c ba a1 e7
=&gt; HMAC-SHA1:
99 f7 68 57 f3 39 cf 11 33 54 6d b4 ac b8 7d 4d 8e e9 c8 2f
=&gt; first 12 bytes:
99 f7 68 57 f3 39 cf 11 33 54 6d b4
</pre>


</p>
<hr/>

<hr/>

<p><br/>
<pre class="example">packet #12
0000   06 c0 a4 a3 a2 a0 02 00 00 00 30 00 81 fb 54 df
0010   e1 bf 56 47 87 88 ea 7b a1 54 37 5b e4 ba d6 27
0020   37 35 e5 14 17 71 a0 12 01 0c 2c 40 f4 7b e3 65
0030   80 4c 78 b2 f3 99 26 59 bc 3d cf 8d ff ff 02 07
0040   06 aa 2d 1d 65 59 5c 03 98 15 b9 b3
</pre>


</p>
<hr/>

<p><br/>
<pre class="example">Decrypt
IV:
81 fb 54 df e1 bf 56 47 87 88 ea 7b a1 54 37 5b
data:
e4 ba d6 27 37 35 e5 14 17 71 a0 12 01 0c 2c 40
f4 7b e3 65 80 4c 78 b2 f3 99 26 59 bc 3d cf 8d
key(K2):
d6 4d 9a a8 6d 62 02 23 2e f8 cb f0 06 31 9b 6b
=&gt; decrypt:
81 1c 63 20 08 01 00 24 01 02 13 02 bf a9 19 00 3c 00 00 00 00 00 de 01 02 03 04 05 06 07 08 08
=&gt; remove pad:
81 1c 63 20 08 01 00 24 01 02 13 02 bf a9 19 00 3c 00 00 00 00 00 de
</pre>


</p>
<hr/>

<p><br/>
<pre class="example">AuthCode
06 aa 2d 1d 65 59 5c 03 98 15 b9 b3
data:
06 c0 a4 a3 a2 a0 02 00 00 00 30 00 81 fb 54 df
e1 bf 56 47 87 88 ea 7b a1 54 37 5b e4 ba d6 27
37 35 e5 14 17 71 a0 12 01 0c 2c 40 f4 7b e3 65
80 4c 78 b2 f3 99 26 59 bc 3d cf 8d ff ff 02 07
key(K1):
e8 9c b1 4c 9f 39 c6 6e 75 e8 e5 54 d4 11 60 b9 1c ba a1 e7
=&gt; HMAC-SHA1:
06 aa 2d 1d 65 59 5c 03 98 15 b9 b3 5f d9 92 df 30 9f d7 57
=&gt; first 12 bytes:
06 aa 2d 1d 65 59 5c 03 98 15 b9 b3
</pre>


</p>
<hr/>

<hr/>

<p><br/>
<pre class="example">packet #13
0000   06 c0 fb 2d b5 ff 05 00 00 00 20 00 85 60 50 c6
0010   26 3e f1 3e 83 12 41 ba 22 4d b0 b5 e9 9e 3c af
0020   52 f3 1f d1 05 26 54 95 f1 30 f4 ce ff ff 02 07
0030   b6 5f c3 e0 4a 60 2f e2 02 34 ab b8
</pre>


</p>
<hr/>

<p><br/>
<pre class="example">IV:
85 60 50 c6 26 3e f1 3e 83 12 41 ba 22 4d b0 b5
data:
e9 9e 3c af 52 f3 1f d1 05 26 54 95 f1 30 f4 ce
key(K2):
d6 4d 9a a8 6d 62 02 23 2e f8 cb f0 06 31 9b 6b
=&gt; decrypt:
20 18 c8 81 0c 3c fb 2d b5 ff 5b 01 02 03 04 04
=&gt; remove pad:
20 18 c8 81 0c 3c fb 2d b5 ff 5b
</pre>


</p>
<hr/>

<p><br/>
<pre class="example">AuthCode
b6 5f c3 e0 4a 60 2f e2 02 34 ab b8
data:
06 c0 fb 2d b5 ff 05 00 00 00 20 00 85 60 50 c6
26 3e f1 3e 83 12 41 ba 22 4d b0 b5 e9 9e 3c af
52 f3 1f d1 05 26 54 95 f1 30 f4 ce ff ff 02 07
key(K1):
e8 9c b1 4c 9f 39 c6 6e 75 e8 e5 54 d4 11 60 b9 1c ba a1 e7
=&gt; HMAC-SHA1:
b6 5f c3 e0 4a 60 2f e2 02 34 ab b8 93 72 32 d4 d2 bd ae dc
=&gt; first 12 bytes:
b6 5f c3 e0 4a 60 2f e2 02 34 ab b8
</pre>


</p>
<hr/>
</div>
</div>
</div>

<div id="postamble">
<p class="date">Date: 2013/08/29</p>
<p class="author">Author: zhang.bin-jie</p>
<p class="creator">Org version 7.8.11 with Emacs version 24</p>
<a href="http://validator.w3.org/check?uri=referer">Validate XHTML 1.0</a>

</div>
</body>
</html>
